---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SweepMaxSegAngle
source: html/6beec6ab-8441-d992-522b-a03591e99217.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SweepMaxSegAngle Property

"Maximum Segment Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId SweepMaxSegAngle { get; }
```